#include <stdio.h>
// 전처리문(명령어) : 필요한 기능을 불러오는 명령어

// 코드 : 특정 언어로 작성된 텍스트
// 코딩(개발) : 코드를 작성하는 것
// 문법 : 특정 언어별로 요구하는 작성규칙/요령
// 소스파일 : 작성하여 완성된 텍스트파일

// 메모리중 일부를 받는다
// 그 중 일부를 우리가 구분하여 사용하기 위해 준비하는 공간
// main : C언어의 모든 코드가 시작되는 공간
int main(void)
{  
	// ;(세미콜론) : 명령어를 구분시켜주며, 마무리 지어주는 마침표
	// 소스파일에 작성되는 띄어쓰기/엔터는 순수하게 코드 정리용이다.
	// 주의 : 하나인것을 쪼개면 안된다.
	printf("HELLO!"); // HELLO! 출력하는 코드
	return 0; // 프로그램을 정상 종료 시키는 명령어
}


// 주석 : 설명을 적을 수 있는 규칙
// 코드의 실행은 ctrl키 누른 상태로 F5를 눌려 실행
